package main

import (
	"YYS_helper/consts"
	"YYS_helper/models"
	"fmt"
)

func main() {
	fmt.Println(`
    _      _      _   __   ____   __  ___          _  _            _     _ __                
   | |    | |    | |  \ \ / /\ \ / / / __|        | || |   ___    | |   | '_ \  ___     _ _  
   |_|    |_|    |_|   \ V /  \ V /  \__ \   ___  | __ |  / -_)   | |   | .__/ / -_)   | '_| 
  _(_)_  _(_)_  _(_)_  _|_|_  _|_|_  |___/  |___| |_||_|  \___|  _|_|_  |_|__  \___|  _|_|_  
_| """ || """ || """ || """ || """ ||"""""||"""""||"""""||"""""||"""""||"""""||"""""||"""""| 
"'-0-0-"'-0-0-"'-0-0-"'-0-0-'"-0-0-'"-0-0-'"-0-0-'"-0-0-'"-0-0-'"-0-0-'"-0-0-'"-0-0-'"-0-0-'

请输入：
1.妖气封印
2.御魂副本(队长)

$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
  tips:
  选择式神碎片前，请保持游戏在庭院内，并且先在组队界面中选择好想刷的妖气封印副本
  选择御魂副本前，请先锁定好阵容，并作为队长创建好组队房间
  在做好上述准备后输入了选项后，请在倒计时结束前点击游戏窗口，保证窗口是激活状态
$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$

`)
	var selection int
	for {
		_, err := fmt.Scanln(&selection)
		if err != nil || (selection != 1 && selection != 2) {
			fmt.Println(`
输入错误，请重新输入：
1.妖气封印
2.御魂副本(队长)
`)
		} else {
			break
		}
	}
	switch selection {
	case 1:
		model := models.GetModel(consts.MODEL_HERO_PIECE)
		model.Start()
	case 2:
		model := models.GetModel(consts.MODEL_SOUL)
		model.Start()
	}
}
